CSI API ETABS v1
cGenDispl.GetTypeOAPI Method
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetTypeOAPI(
	string name,
	ref int MyType
)
Function GetTypeOAPI (
	name As String,
	ByRef MyType As Integer
) As Integer
Dim instance As cGenDispl
Dim name As String
Dim MyType As Integer
Dim returnValue As Integer
returnValue = instance.GetTypeOAPI(name,
	MyType)
int GetTypeOAPI(
	String^ name,
	int% MyType
)
abstract GetTypeOAPI :
        name : string *
        MyType : int byref -> int
Parameters
name
Type: System.String
MyType
Type: System.Int32
Return Value
Type: Int32
See Also
Reference
cGenDispl Interface
ETABSv1 Namespace